<p>FORM 2</p><p>'Floating Bilayer Tablet of Amoxicillin trihydrate and aqueous extract of Benincasa hispida fruits"</p><p>TITLE OF THE INVENTION</p><p>THE FOLLOWING SPECIFICATION DESCRIBES THE NATURE OF TH</p><p>Floating   Drug   Delivery   System is considered suitable for  treating different types of gastrointestinal tract infections as it overcomes the difficulties like gagging O choking while swallowing medicinal pills. Bilayer floating tablet remains a novel approach designed for the effective advance of controlled delivery design laterally through numerous sorts to deliver an approach of efficacious drug transport system  Bilayer floating tablet has advantages like Enhanced   bioavailability, Targeted   therapy for ailments in the upper GIT, Reduces fluctuation of drug concentration, Minimise adverse activity at the colon site.</p><p>Few patent and non-patent literature has been retrieved that discloses bilayer tablet for the treatment of peptic ulcers includes: Indian patent application no. 2117/MUM/2O14 discloses floating dosage  form  containing   Ciprofloxacin (Antibacterial) Misoprostol  (Synthetic Prostaglandin El (PGEl) Analog) to serve as antibacterial and also prevent gastric ulcer: AAPS PharmSciTech: 2012 Dec; 13(4): 1518-1523; Arati N. Ranade, Sonali S. Wankhede, Nisharani S. Ranpise, and Mayur $ Mundada discloses development of a bilayer floating tablet of amoxicillin and Aloe vera gel powder for the treatment of peptic ulcer: In Manish A</p><p>Various types of treatments are available in the market for treating peptic ulcer in the form of oral medications. Traditional  oral  dosage forms, such as tablets   and  capsules, provide specific drug concentration in systemic circulation that does not release at a constant rate for a long time and does not account for site- specific absorption rates within the gastrointestinal tract: As a result; there is a need to develop dosage forms that release the drug at the right time and at the desired rate at the right site.</p><p>The present invention relates to the Floating Bilayer Tablet of Amoxicillin trihydrate and the aqueous extract   of Benincasa   hispida   fruits and   preparation method   thereof   and more particularly to the bilayer floating tablet of Amoxicillin trihydrate and the aqueous extract of Benincasa hispida fruits for the treatment of peptic ulcers.</p><p>Ulcers are perforations in the lining of the upper gastrointestinal tract (GI tract). Peptic ulcer is a sore in the lining of stomach or duodenum due to attack by acid pepsin. While acid is still thought to have a role in ulcer formation, the most common cause of ulcer illness is now thought to be a stomach infection caused by the bacteria Helicobacter_ pylori.</p><p>TECHNICAL FIELD OF INVENTION:</p><p>BACKGROUND</p><p>Polymer is selected   from the group containing Hydroxypropyl  methylcellulose (HPMC), sodium alginate, gelatin, chitosan, cellulose derivatives, semisynthetic polymers, synthetic polymers.</p><p>Effervescent agents selected from the group sodium bicarbonate, sodium carbonate, adipic acid, malic acid, tartaric acid, ascorbic acid, fumaric acid, maleic acid, succinic acid, Or citric</p><p>Lubricant is selected  from talc, silica, fats, e.g.  vegetable stearin,  magnesium stearate or stearic acid.</p><p>Rachchh et al (2008) The antiulcer activity of Benincasa hispida (Thunb.) fruits is evaluated in rats against ethanol-induced gastric mucosal damage, pylorus ligated (PL) gastric ulcers, and cold restraint-stress (CRS)-induced gastric ulcer models</p><p>The present invention relates to the Floating Bilayer Tablet of Amoxicillin trihydrate and aqueous extract of Benincasa hispida fruits  and preparation  method for the treatment of peptic ulcer: The bilayer floating tablet comprises of Amoxicillin trihydrate, aqueous extract of Benincasa hispida fruits, a polymer, effervescent agent; lubricant, glidant and compression aid element.</p><p>SUMMARY OF THE INVENTION</p><p>However; no attempt is made of combining amoxicillin and aqueous extract of Benincasa hispida fruits in the form of a bilayer tablet:</p><p>Some of the objects of the presently disclosed invention, of which at the minimum one object is fulfilled by at least one embodiment disclosed herein are as follow:</p><p>OBJECTS OF THE INVENTION</p><p>a) An   object of the   present   invention is to develop a floating  bilayer   tablet of Amoxicillin trihydrate and aqueous extract of Benincasa hispida fruits.</p><p>Amoxicillin trihydrate and aqueous extract of Benincasa hispida fruits. b) Another   object of the   present   invention is usage of   floating   bilayer tablet of Amoxicillin trihydrate and aqueous extract of Benincasa hispida fruits for treating peptic ulcer.</p><p>Amoxicillin trihydrate and aqueous extract of Benincasa hispida fruits. b) Another   object of the   present   invention is usage of floating   bilayer tablet of Amoxicillin trihydrate and aqueous extract of Benincasa hispida fruits  for treating pentic ulcer</p><p>is fulfilled by at least one embodiment disclosed herein are as follow:</p><p>Various evaluation parameters are studied for the characterization of floating bilayer tablets The floating bilayer tablet is optimized on the basis of floating lag time and total floating time. The formulation containing HPMC K4M and HPMC KIOOM of 85.15 and effervescent agent sodium bicarbonate and citric acid 4:1 is found to give satisfactory release. It shows 89.36% drug release within 8 hours. It is subjected to mathematical model fittings to find out the drug release mechanism: On the basis of coefficient regression value, 0.9578, Higuchi model is the best fit model for the formulation: n value was  found to be 0.518 which signifies that it shows release pattern of non Fickian type (i.e-, the release pattern was govern by more than one process). In weight gain and water uptake study it has been observed that swelling increased up to 4-5 hours but after that it decreased. In first 4-5 hours  water is absorbed by the polymer and 179 weight gain by tablet is seen_</p><p>Preparation of Floating Bilayer Tablet: Round shaped flat punch with diameter 1.5 cm is used to punch the tablets. Preparation of powder blend includes: First layer: Direct compression method is used to prepare bilayer tablet  Amoxicillin, HPMC K4M, HPMC KIOOM, NaHCO3, Citric   acid are passed  through sieve no #40. All the ingredients are geometrically mixed in mortar to obtain a homogenous blend. Magnesium stearate and talc are added t0 the above mixture. The blend 1 is compressed at low pressure on tableting machine to form first layer with amoxicillin trihydrate drug: Second layer: Aqueous extract of Benincasa hispida fruits  and Avicel PH 102 are   mixed together in mortar and pestle to form homogeneous mixture. Then the blend 2 is compressed on blend 1 to form the bilayer tablet:</p><p>Process for preparation of floating bilayer tablet includes: preparation of aqueous extract of Benincasa hispida fruits; pre-formulation studies of aqueous extract of Benincasa hispida fruits with respect to determination of extraction yield, organoleptic properties, phytoconstituents and acid   neutralizing   capacity; evaluation of   formulation of   Bilayer floating tablet:</p><p>Binders are selected from the group Avicel PH 102, cellulose, gelatin, cellulose derivatives, polyvinyl pyrrolidone, starch, sucrose, mannitol, polyethylene glycol, and liquid glucose.</p><p>Glidant is selected from talc, colloidal silicon dioxide, magnesium stearate, and silica.</p><p>Preparation of Floating Bilayer Tablet: Round shaped flat punch with diameter 1.5 cm is used to punch the tablets Preparation of powder blend includes:</p><p>First layer: Direct compression method is used to prepare bilayer tablet  Amoxicillin, HPMC K4M, HPMC KIOOM, NaHCO3, Citric   acid are passed  through sieve no #40. All the ingredients are geometrically mixed in mortar to obtain a homogenous blend. Magnesium stearate and talc are added t0 the above mixture. The blend 1 is compressed at low pressure on tableting machine to form first layer with amoxicillin trihydrate drug:</p><p>UI Lauic L1fls IACIIIIC LU TUIIII Ifol 14y ~1 Vv ILII CIOAICIIIII LI [1) urall 414s</p><p>Polymer is   selected  from the   group containing Hydroxypropyl  methylcellulose (HPMC), sodium alginate, gelatin, chitosan, cellulose derivatives, semisynthetic polymers, synthetic polymers</p><p>Effervescent agents selected from the group sodium bicarbonate, sodium carbonate, adipic acid, malic acid, tartaric acid, ascorbic acid, fumaric acid, maleic acid, succinic acid, O citric acid</p><p>From in vivo study it is concluded that powdered aqueous extract of Benincasa hispida fruits and amoxicillin trihydrate have gastric acid inhibitory properties in addition to gastroprotective activity. Antiulcer activity is studied separately oly for aqueous extract of Benincasa hispida fruits which shows it has anti-inflammatory activity along with anti-ulcer activity which suggests its usage in peptic ulcer treatment</p><p>The present invention relates to the Floating Bilayer Tablet of Amoxicillin trihydrate and aqueous extract of Benincasa hispida fruits  and preparation  method for the treatment of peptic ulcer: The bilayer floating tablet comprises of Amoxicillin trihydrate, aqueous extract of Benincasa hispida fruits, a polymer, effervescent agent, lubricant, glidant and compression aid element.</p><p>Lubricant is selected from talc, silica, fats, eg  vegetable stearin, magnesium stearate or stearic acid.</p><p>DETAIL DESCRIPTION OF THE INVENTION</p><p>BRIEF DESCRIPTION OF THE ACCOMPANYING DRA WING</p><p>The present invention will now be described with the help of the accompanying drawings, in which:</p><p>FIG 3: illustrates Histopathological studies of rat stomach: Group I (a-g), Group II (b-h), Group III (c-i), Group IV (d-J), Group V (e-k) and Group VI (f-1)</p><p>FIG 1: illustrates Pictorial Representation of the tablet</p><p>FIG 2: illustrates Pictorial presentation of Stomach tissue of rat of group I to VI</p><p>FIG 1: illustrates Pictorial Representation of the tablet</p><p>FIG 2: illustrates Pictorial presentation of Stomach tissue of rat of group I to VI</p><p>The present invention will now be described with the help of the accompanying drawings, in which:</p><p>FIG 1: illustrates Pictorial Representation of the tablet</p><p>FIG 2: illustrates Pictorial presentation of Stomach tissue of rat of group Ito VI</p><p>As the first step cuticle of the Benincasa hispida fruits is removed and seeds are separated: The pulp is grinded by an electric mixer: Further, the pulp is dried under shade for 1 day and at room temperature for 1 day to obtain in powder form: The powder is first defatted with 250 ml petroleum ether for 50 mg of powder by the soxhlet apparatus for 24 h: The defatted powder is then dried and extracted with 250 ml of ethyl acetate for 24 h and thereafter with 250 ml methanol for 24 h successively. The remaining powder is dried and extracted with 250 ml distilled water for 24 h to give aqueous extract: Further to get the dry form (powder) of aqueous extract it is dried by rota evaporator to remove excess water: The dried fractions are stored in a refrigerator at 49C throughout the study.</p><p>Binders are selected from the group Avicel PH 102, cellulose, gelatin, cellulose derivatives olyvinyl pyrrolidone, starch, sucrose, mannitol, polyethylene glycol, and liquid glucose. reparation of Aqueous extract of Benincasa hispida fruits:</p><p>Pre-formulation study of Aqueous extract of Amoxicillin trihydrate and aqueous extract of Benincasa hispida fruits:</p><p>Table 1. Phytochemical test for flavonoid</p><p>Glidant is selected from talc, colloidal silicon dioxide, magnesium stearate, and silica</p><p>The sample of amoxicillin trihydrate is found to be white to off-white crystalline powder: It has a characteristic odor and bitter taste. The sample of aqueous extract of Benincasa hispida fruits is found to be brown in color and it has aromatic odor.</p><p>Table 1. Phytochemical test for flavonoid</p><p>Preliminary Phytoconstituent Test:</p><p>Organoleptic Properties:</p><p>14UILd 10 rvunu LU 0o UIUYY [</p><p>Benincasa hispida fruits: Organoleptic Properties: The sample of amoxicillin trihydrate is found to be white to off-white crystalline powder: It has a characteristic odor and bitter taste. The sample of aqueous extract of Benincasa hispida fruits is found to be brown in color and it has aromatic odor. Extraction yield: The extraction yield of aqueous extract of Benincasa hispida was found to be 5.4%. Preliminary Phytoconstituent Test: Test for Flavonoid:</p><p>Organoleptic Properties:</p><p>The sample of amoxicillin trihydrate is found to be white to off-white crystalline powder: It has a characteristic odor and bitter taste. The sample of aqueous extract of Benincasa hispida fruits is found to be brown in color and it has aromatic odor: Extraction yield: The extraction yield of aqueous extract of Benincasa hispida was found to</p><p>Benincasa hispida fruits:</p><p>Preliminary Phytoconstituent Test: Test for Flavonoid:</p><p>Table 2. Phytochemical test for phenolic compound.</p><p>A preliminary phytoconstituent test for flavonoids and phenolic  compounds reveals their presence in the aqueous extract of Benincasa hispida fruits</p><p>The ANC value obtained for the aqueous extract of Benincasa hispida fruits (100, 150, 200, 250 and 300 mgl 5 ml) is compared with the standard antacid's mixture. ANC  value of aqueous extract of Benincasa hispida at concentration 300 mg was found to be near standard mixture ANC value i.e. 6.9. Therefore, 300 mg concentration of aqueous extract of Benincasa hispida fruits is used for further study. Preparation of Floating Bilayer Tablet:</p><p>2) Add NaOH to residue yellow color Yellow color formed forms which and decolorized after decolorizes after addition of acid addition of acid</p><p>Round shaped flat punch with diameter 1.5 cm is used to punch the tablets. Preparation of powder blend includes:</p><p>Table 2. Phytochemical test for phenolic compound. Phytochemical Observation Inference Pictorial presentation test</p><p>n Vitro Acid Neutralizing Capacity (ANC)</p><p>Preparation of Floating Bilayer Tablet: Round shaped flat punch with diameter 1.5 cm is used to punch the tablets.</p><p>Phytochemical test</p><p>After compression various   quality control tests were carried out, which demonstrates following organoleptic properties viz. colour, odour and shape. The formulation was found to be white for first layer and brown for second layer: Floating characteristics like floating lag time and total floating time were studied. The tablet did not stick to the dissolution vessel O the shaft. It is   found to float   freely in the vessel without being hindered by the shaft movement: The formulation showed 80.09% drug release at the end of 8 hours. While 52% drug release at 4 h_ Thus, it did not meet the criteria of controlled release matrix, which requires a drug release of S0% at the end of 3 hour. The release pattern was found to be Higuchi diffusion kinetic, in which R2 was found to be 0.9578.</p><p>The in vivo study for checking the effect of amoxicillin trihydrate and aqueous extract of Benincasa hispida fruits in combination for ulcer therapy is carried out by pylorus ligation method in rats. Omeprazole, amoxicillin, and aqueous extract of Benincasa hispida fruits, bilayer tablet powder suspensions were prepared by mixing with gum acacia powder: Groups of animals were   divided such as first group as normal control only for histopathological studies, second as gastric ulcer control (vehicle solution without drug), third as treated with</p><p>First layer: Direct compression method is used to prepare bilayer tablet  Amoxicillin, HPMC K4M, HPMC KIOOM, NaHCO3, Citric   acid are passed  through sieve no #40. All the ingredients are geometrically mixed in mortar to obtain a homogenous blend. Magnesium stearate and talc are added t0 the above mixture. The blend 1 is then subjected for evaluation of flow characteristics.  Further; the blend L is   compressed at low pressure on tableting machine to form first layer with amoxicillin trihydrate drug: Second layer: Aqueous extract of Benincasa hispida fruits and Avicel PH 102 are mixed together in mortar and pestle to form homogeneous mixture. Then the blend 2 is compressed on blend 1 to form the bilayer tablet</p><p>Formulation of the Bilayer tablet A_ bilayer tablet was prepared using HPMC polymer, sodium bicarbonate, citric acid, Avicel PH 102, magnesium stearate and talc as the first layer and the second layer contained aqueous extract of Benincasa hispida fruits and Avicel PH 102.</p><p>General appearance</p><p>In Vivo study:</p><p>Evaluation Floating Bilayer Tablet: (Post compression studies)</p><p>machine t0 form frst layer with amoxiclllin trhyarate drug: Second layer: Aqueous extract of Benincasa hispida fruits and Avicel PH 102 are mixed together in mortar and pestle to form homogeneous mixture. Then the blend 2 is compressed on blend 1 to form the bilayer tablet:</p><p>Evaluation Floating Bilayer Tablet: (Post compression studies)</p><p>In Vivo study:</p><p>standard omeprazole (20 mg/kg), fourth group received marketed amoxicillin (50 mg/kg), fifth group treated with  bilayer  tablet of   amoxicillin  trihydrate and aqueous extract of Benincasa hispida fruits (50 and 300 mglkg) and sixth group received only aqueous extract of Benincasa hispida fruits (300 mg/kg). Wistar rats were anaesthetized with ketamine (20 mg/kg) and xylazine (13 mg/kg) a portion of the abdomen is opened by small midline incision below the xiphoid process Thepylorus portion of the stomach is lifted and ligated  The stomach is then sealed up by interrupted sutures while precautions are made to prevent traction to the pylorus or harm to its blood supply. 30 minutes prior to the ligation, the appropriate medication solutions are given orally. Animals in all the 6 groups after 5 hours of ligation are sacrificed and the stomachs are removed, cut along the greater curvature, and examined for ulcer</p><p>Results of group 2 which is gastric ulcer control group shows ulcer while results of group 3, 4,5, 6 shows reduction in ulceration after 5 hours of the treatment. The values of ulcer index</p><p>Parameters estimated are ulcer index and % inhibition of ulceration</p><p>Table 4. Effect of treatment on pylorus ligation induced gastric ulcer in rats</p><p>Table_3_Groups_of_animals</p><p>Parameters estimated are ulcer index and % inhibition of ulceration</p><p>Table 4 Effect of treatment on pylorus ligation induced gastric ulcer in rats</p><p>Table_3_Groups of_anima</p><p>Table 3_Groups of_animals Dose Route of administration Control Oral Gastric Ulcer Control Oral Standard Omeprazole (2Omg/kg) Oral Marketed Amoxicillin (SOmg/kg) Oral Bilayer tablet (SOmg/kg and 300mg) Oral Aqueous extract of Benincasa Oral hispida (300mg_</p><p>Histopathological studies for the ulcer control group in Figure 3 shows disruption in intact mucosa with inflammatory cells when compared to normal rat stomach (Figure3: &,g,b,h). However, animals treated with omeprazole shows almost normal pattern (Figure 3: c-i). In case of amoxicillin treated animals (Figure 3: d-J) the microphotographs show superficial ulcer with inflammatory cells the base of ulcerated area indicated by arTows Further groups which are animals treated with   bilayer  tablets (Figure 3: e-k) and aqueous extract of Benincasa   hispida fruits   (Figure 3: f-1) shows no ulcer and retains normal stomach physiology. Histopathological evaluation of group VI it indicates that the aqueous extract of Benincasa hispida fruits have anti- inflammatory activity along with antiulcer activity.</p><p>The stomach samples from the pylorus ligated treated groups are preserved in 10% buffered formalin and processed for routine paraffin block preparation: Using a rotary microtome, sections of thickness of about 5 mm are cut and stained with hematoxylin and eosin. These are examined under the   microscope for histopathological changes   such as degeneration, hemorrhage, edematous   appearance, erosion; and necrosis are compared with normal histopathology of rat stomach of normal control</p><p>70.50% of ulcer inhibition. In case of only aqueous extract of Benincasa hispida fruits shows 62.29% ulcer inhibition. The combination of aqueous extract of Benincasa hispida fruits along with  amoxicillin  trihydrate having gastric acid inhibitory properties in addition to gastroprotective   activity of aqueous extract of Benincasa hispida fruits at 300 mg concentration indicating its usage in peptic ulcer treatment:</p><p>Histopathological Evaluation:</p><p>Histopathological Evaluation:</p><p>We Claim,</p><p>1) A Floating Bilayer Tablet comprises of Amoxicillin Trihydrate, Aqueous extract of Benincasa hispida fruits, polymers, effervescent agents, lubricating agent, binding agent and glidant:</p><p>Preparation of aqueous extract of Benincasa hispida fruits Evaluation of aqueous extract of Benincasa hispida fruits Preparation of Floating Bilayer Tablet Evaluation of Floating Bilayer Tablet</p><p>The Floating Bilayer Tablet as claimed in claim 1, wherein effervescent agent sodium carbonate and citric acid are in the ratio 1.4.</p><p>9) The Floating Bilayer Tablet as claimed in claim is used for the treatments of peptic ulcers_</p><p>benincasa nbsplaa IrUiLS, pOly mers, CIICT VCSCCnt agells, luUfcalllg agell, DI1g agent and glidant:</p><p>3) The Floating Bilayer Tablet as claimed in claim 1, wherein glidant is selected from talc, colloidal   silicon dioxide, magnesium   stearate, and silica; and binding agents selected   from the group Avicel PH 102, cellulose, gelatin, cellulose   derivatives, polyvinyl   pyrrolidone, starch; sucrose, mannitol, polyethylene   glycol, and  liquid glucose.</p><p>The Floating Bilayer Tablet as claimed in claim 1, wherein effervescent agents are selected from the group sodium bicarbonate, sodium carbonate, adipic acid, malic acid, tartaric acid, ascorbic acid, fumaric acid, maleic acid, succinic acid, or citric</p><p>The Floating Bilayer Tablet as claimed in claim 1, wherein lubricant is selected from the group containing talc, silica, fats, like vegetable stearin, magnesium stearate Or stearic acid. The Floating Bilayer Tablet as claimed in claim 1, wherein glidant is selected from talc, colloidal  silicon   dioxide, magnesium  stearate, and  silica; and binding agents selected from the group Avicel PH 102, cellulose, gelatin, cellulose derivatives; polyvinyl  pyrrolidone,  starch; sucrose, mannitol, polyethylene glycol, and   liquid glucose. The Floating Bilayer Tablet as claimed in claim 1 is used for the treatments of peptic ulcers_</p><p>10) A method of preparation of floating bilayer tablet comprises of;</p><p>Preparation of aqueous extract of Benincasa hispida fruits</p><p>7) The Floating Bilayer Tablet as claimed in claim 1, wherein lubricant is selected from the group containing talc, silica, fats, like vegetable stearin, magnesium stearate Or stearic acid.</p><p>The Floating Bilayer Tablet as claimed in claim 1, wherein lubricant is selected from the group containing talc, silica, fats, like vegetable stearin, magnesium stearate OI stearic acid.</p><p>3) The Floating Bilayer Tablet as claimed in claim 1, wherein polymers are selected from the group containing Hydroxypropyl methylcellulose (HPMC), sodium alginate, gelatin, chitosan, cellulose derivatives, semisynthetic polymers, synthetic polymers. 4) The Floating Bilayer Tablet as claimed in claim 1, wherein HPMC K4M and HPMC</p><p>10) A method of preparation of floating bilayer tablet comprises of; Preparation of aqueous extract of Benincasa hispida fruits</p><p>agent and glidant: 2) The Floating Bilayer Tablet as   claimed in claim 1, wherein dose   of Amoxicillin Trihydrate in bilayer tablet is SOmg/kg and dose of Aqueous extract of Benincasa hispida fruits is 300 mglkg: 3) The Floating Bilayer Tablet as claimed in claim 1, wherein polymers are selected from the group containing Hydroxypropyl methylcellulose (HPMC), sodium alginate, gelatin, chitosan, cellulose derivatives, semisynthetic polymers, synthetic polymers. The Floating Bilayer Tablet as claimed in claim 1, wherein HPMC K4M and HPMC KIOOM polymers are in the ratio of 85:15. 5) The Floating Bilayer Tablet as claimed in claim 1, wherein effervescent agents are selected  from the group sodium bicarbonate, sodium carbonate, adipic acid, malic acid, tartaric acid, ascorbic acid, fumaric acid, maleic acid, succinic acid, or citric acid.</p><p>Ine Floauing blayer</p><p>carbonate and citric acid are in the ratio 1:4.</p><p>9) The Floating Bilayer Tablet as claimed in claim 1 is used for the treatments of peptic ulcers. 10) A method of preparation of floating bilayer tablet comprises of; Preparation of aqueous extract of Benincasa hispida fruits Evaluation of aqueous extract of Benincasa hispida fruits Preparation of Floating Bilayer Tablet Evaluation of Floating Bilayer Tablet</p><p>Evaluation of aqueous extract of Benincasa hispida fruits</p><p>Preparation of aqueous extract of Benincasa hispida fruits</p><p>1) A Floating Bilayer Tablet comprises of Amoxicillin Trihydrate, Aqueous extract of Benincasa hispida fruits, polymers, effervescent agents, lubricating agent;  binding agent and glidant: 2) The Floating Bilayer Tablet as   claimed in claim 1, wherein dose  of Amoxicillin Trihydrate in bilayer tablet is SOmg/kg and dose of Aqueous extract of Benincasa hispida fruits is 300 mglkg: 3) The Floating Bilayer Tablet as claimed in claim 1, wherein polymers   are selected from the group containing Hydroxypropyl methylcellulose (HPMC), sodium alginate, gelatin, chitosan, cellulose derivatives, semisynthetic polymers, synthetic polymers. 4) The Floating Bilayer Tablet as claimed in claim 1_ wherein HPMC K4M and HPMC KIOOM polymers are in the ratio of 85.15.</p><p>2) The Floating Bilayer Tablet as claimed in claim 1, wherein dose of Amoxicillin Trihydrate in bilayer tablet is SOmg/kg and dose of Aqueous extract of Benincasa hispida fruits is 300 mglkg:</p><p>10) A method of preparation of floating bilayer tablet comprises of; Preparation of aqueous extract of Benincasa hispida fruits</p><p>The Floating Bilayer Tablet as claimed in claim 1, wherein HPMC K4M and HPMC KIOOM polymers are in the ratio of 85.15.</p><p>hispida fruits is 300 mglkg: The Floating Bilayer Tablet as claimed in claim 1, wherein polymers are selected from the group containing Hydroxypropyl methylcellulose (HPMC), sodium alginate, gelatin, chitosan, cellulose derivatives, semisynthetic polymers, synthetic polymers. The Floating Bilayer Tablet as claimed in claim 1, wherein HPMC K4M and HPMC KlOOM polymers are in the ratio of 85.15.</p><p>2) The Floating Bilayer Tablet as   claimed in claim 1, wherein dose of Amoxicillin Trihydrate in bilayer tablet is SOmg/kg and dose of Aqueous extract of Benincasa hispida fruits is 300 mglkg: 3) The Floating Bilayer Tablet as claimed in claim 1, wherein polymers are   selected</p><p>Freparation OT Floauing blayer abet Evaluation of Floating Bilayer Tablet</p><p>In  vitro study, In vivo study and histopathological evaluation of the batch formulation</p><p>Dated this 30th day of September 2022 For Applicants:</p><p>formulation</p><p>Dated this 30th day of September 2022</p><p>The present invention relates to the Floating Bilayer Tablet of Amoxicillin trihydrate and aqueous  extract of Benincasa hispida fruits and preparation  method for the treatment of peptic ulcer: The bilayer floating tablet comprises of Amoxicillin trihydrate, aqueous extract of Benincasa hispida fruits, polymers HPMC K4M and HPMC KIOOM in the ratios of 85.15, sodium bicarbonate and citric acid in the ratio 1.4 as effervescent agents, Avicel PH 102, Magnesium stearate and talc. Aqueous extract   of Benincasa hispida   fruits   shows   anti- inflammatory activity along with antiulcer activity.</p><p>ABSTRACT</p><p>'Floating Bilayer Tablet of Amoxicillin trihydrate and aqueous extract 0f Benincasa hispida fruits"</p><p>SFloating Bilayer Tablet of Amoxicillin trihydrate and aqueous extract of Benincasa hispida fruits"</p><p>Figure I: Pictorial Representation of the tablet</p><p>Figure I: Pictorial Representation of the tablet</p><p>Sheet No 01 of 03</p><p>Drawings</p><p>Dated this 30th day of September 2022 For Applicants:</p><p>4541</p><p>Figure 2. Pictorial presentation of Stomach tissue of rat of group I to VI</p><p>II</p><p>II.</p><p>Dated this 30th day of September 2022</p><p>For Applicants:</p><p>Dated this 30th_ day of September 2022 For Applicants:</p><p>Sheet No 03 of 03</p><p>b</p><p>The Controller of Patents,</p><p>Figure 3: Histopathological studies of rat stomach: Group I (a-g), Group II (b-h) Group III (c-i) Group IV (d-J) Group V (e-k) and Group VI (f-l)</p><p>Sheet No 03 of 03</p><p>Sheet No 03 of 03</p><p>4</p><p>16*10</p>