[
    {
        "data": {
            "text": "M/S. Pepsi Foods Ltd. & Anr vs Special Judicial Magistrate & Ors on 4 November, 1997        "
        }
    },
    {
        "data": {
            "text": "There are two appellants, second appellant is the Managing Director of first appellant, The respondents are three. First respondent is the court where the appellants alongwith others have been summoned for having committed offences under Sections 7/16 of the Act. The second respondent is the complainant and the third respondent is the State of Uttar Pradesh."
        }
    },
    {
        "data": {
            "text": "The allegation in the complaint is that complainant was sold a bottle of beverage under the brand Lehar Pepsi"
        }
    },
    {
        "data": {
            "text": "Having set out the relevant provisions of law to some extent and before we consider the merits and demerits of the case and the jurisdiction of the High Court under Article 226 and 227 of the Constitution, we may refer to the complaint and the evidence which led the 1st respondent to issue summons to the appellants and others for an offence under Section 7 of the Act."
        }
    },
    {
        "data": {
            "text": "The complainant (second respondent) is a student. He says that he is appearing in examinations is various State and Central Services. On September 13, 1993, he went to a shop known as The Flavours Fast Food and Cool Corner and purchased 500 m1. chilled bottle of 'Lehar Pepsi' for drinking. Nitin Sachdeva is stated to have (Accused named as No.1) sold the bottle to the complainant. After he had consumed the beverage contained in the bottle, the complainant felt a strange taste. On observation, he found that the bottle contained many white particles. The complainant felt giddy and nauseated. One Divya Trivedi was present at the shop as a customer. Another shopkeeper by the name Lal Bahadur Singh who owned a shop opposite to from where the complainant purchased the 'Lehar Pepsi' bottle was also present. They were shown the bottle by the complainant. The beverage was put in two glasses to see the while particles clearly and Nitin Sachdeva accepted the presence of the particles. Suspecting adulteration, the complainant told Nitin Sachdeva that he would take sample of the beverage for analysis. He thereupon gave notice to Nitin Sachdeva, purchased three clean and dry empty new plastic jars from hereby Suri Stores and filled up the same with the beverage and which, according to the complainant, were sealed as per rules, wrapped in the paper and tied with thick yearn. Nitin Sachdeva signed the jars and put stamp of his shop thereon. The complainant obtained the stamp of the shop The Flavour Fast Food and Cool Corner on a separate paper and one jar of the sample with stamp used in the sample was deposited by the complainant in he office of the State Public Analyst, Uttar Pradesh, Lucknow on September 20, 1993 for analysis. The complainant says that the three jars were sealed in the presence of the witnesses and he also recorded their statements in writing including that of Nitin Sachdeva. The complainant also made a report to the Police on September 13, 1993 itself about the incident."
        }
    },
    {
        "data":{
            "text": "In support of the complaint allegations, the Complainant has recorded his statement and presented the statement on oath of the witness Lal Bahadur Singh and as documentary evidence notice annexure-1, receipt for deposit of the bottle of sample for analysis with Public Analyst annexure-3A and application to the Public Analyst for analysis annexure-3B, report of the incident with O.S. Ghazipur annexure-4, cash memo issued by the vendor annexure-5, statement of Executive Director of Pepsi Foods Ltd. annexure-6, report of the Public Analyst annexures 7A and 7B and prescriptions of the doctor for treatment have been filed."
        }
    }
]